app/controllers/api/tasks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
---
    def index
      user = User.find_by(id: params[:api_key])
      @tasks = user.tasks.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["content", "New"], ["created_at", "2022-04-20 03:12:46.889062"], ["updated_at", "2022-04-20 03:12:46.889062"]]
---
    def create
      user = User.find_by(id: params[:api_key])
      @task = user.tasks.new(task_params)

      return render 'bad_request', status: :bad_request if not @task.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", nil], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 7]]
---
    def destroy
      user = User.find_by(id: params[:api_key])
      @task = user.tasks.find_by(id: params[:id])

      return render 'not_found', status: :not_found if not @task
      return render 'bad_request', status: :bad_request if not @task.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 28], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2022-04-25 04:05:16.519654"], ["id", 28]]
---
    def mark_complete
      user = User.find_by(id: params[:api_key])
      @task = user.tasks.find_by(id: params[:id])

      return render 'not_found', status: :not_found if not @task
      return render 'bad_request', status: :bad_request if not @task.update(completed: true)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 29], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 0], ["updated_at", "2022-04-25 04:54:10.823433"], ["id", 29]]
---
    def mark_active
      user = User.find_by(id: params[:api_key])
      @task = user.tasks.find_by(id: params[:id])

      return render 'not_found', status: :not_found if not @task
      return render 'bad_request', status: :bad_request if not @task.update(completed: false)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def validate_user
      user = User.find_by(id: params[:api_key])