app/controllers/tasks_controller.rb

  def show
    user = User.find_by(id: params[:api_key])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def index
    user = User.find_by(id: params[:api_key])
    @tasks = user.tasks.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]

  def validate_user
    user = User.find_by(id: params[:api_key])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]